# -----------------------------------------------------
# コメント
# -----------------------------------------------------
# コメントアウトされたソースコードはいくら書いても実行されない
# puts 'こんにちは'

# -----------------------------------------------------
# 出力
# -----------------------------------------------------

# puts 'こんにちは'

# -----------------------------------------------------
# 変数
# -----------------------------------------------------

# hensuu = '何らかのデータ'
# puts hensuu

# -----------------------------------------------------
# 変数の計算
# -----------------------------------------------------

# ichiniti_no_zikan = 24
# ichizikan_no_hun = 60
# ippun_no_byou = 60
#
# ichiniti_no_byousuu = ichiniti_no_zikan * ichizikan_no_hun * ippun_no_byou
#
# puts ichiniti_no_byousuu

# -----------------------------------------------------
# 配列
# -----------------------------------------------------

# fruits = ['リンゴ', 'バナナ', 'オレンジ']
#
# fruits.each do |fruit|
#   puts fruit
# end

# -----------------------------------------------------
# ハッシュとシンボル
# -----------------------------------------------------

# fruits = {
#   'apple'  => 'リンゴ',
#   'banana' => 'バナナ',
#   'orange' => 'オレンジ',
# }
#
# fruits = {
#   :apple  => 'リンゴ',
#   :banana => 'バナナ',
#   :orange => 'オレンジ',
# }
#
# fruits = {
#   apple: 'リンゴ',
#   banana: 'バナナ',
#   orange: 'オレンジ',
# }
#
# fruits = {
#   apple:  :リンゴ,
#   banana: :バナナ,
#   orange: :オレンジ,
# }
#
# fruits.each do |key, value|
#   p key
#   p value
# end

# -----------------------------------------------------
# 四則演算
# -----------------------------------------------------

# num1 = 1 + 2       # 3
# num2 = 1 - 2       # -1
# num3 = 2 * 5       # 10
# num4 = 6 / 3       # 2
# num5 = 5 % 2       # 1 （割った後の余り）
#
# nums = [num1, num2, num3, num4, num5]
#
# nums.each do |num|
#   puts num
# end

# -----------------------------------------------------
# 文字列同士の足し算
# -----------------------------------------------------

# str1 = 'あいう'
# str2 = 'えお'
# str = str1 + str2      # str は 'あいうえお' となります。
# puts str

# -----------------------------------------------------
# 代入演算子(=)と代数演算子(+など)の結合
# -----------------------------------------------------

# +=
# a += b	# a = a + b
# aとbの足し算をした結果をaに代入する
#
# -=
# a -= b	# a = a - b
# aとbの引き算をした結果をaに代入する
#
# *=
# a *= b	# a = a * b
# aとbの掛け算をした結果をaに代入する
#
# /=
# a /= b	# a = a / b
# aとbの割り算をした結果をaに代入する
#
# %=
# a %= b	# a = a % b
# aとbの余り算をした結果をaに代入する

# -----------------------------------------------------
# 比較演算子
# -----------------------------------------------------

# ==
# a == b  # 10 == 10 結果 true
# aとbが等しい場合にはtrueを返す。等しくない場合にはfalseを返す。
#
# !=
# a != b	# 5 != 10 結果 true
# aとbが等しくない場合にはtrueを返す。等しい場合にはfalseを返す。
#
# <
# a < b	 # 1 < 10 結果 true
# aよりbが大きい場合にはtrueを返す。aよりbが小さいか等しい場合にはfalseを返す。
#
# >
# a > b	 # 4 > 7 結果 false
# aよりbが小さい場合にはtrueを返す。aよりbが大きいか等しい場合にはfalseを返す。
#
# <=
# a <= b	# 9 <= 10 結果 true
# aよりbが大きいか等しい場合にはtrueを返す。
#
# >=
# a >= b	# 10 >= 9 結果 true
# aよりbが小さいか等しい場合にはtrueを返す。

# -----------------------------------------------------
# 論理演算子
# -----------------------------------------------------

# result = (1 == 1) && (2 == 2)    # true
# result = (1 == 1) and (2 == 2)   # true
#
# result = (1 == 2) && (2 == 2)    # false
# result = (1 == 2) and (2 == 2)   # false
#
# result = (1 == 2) || (2 == 2)    # true
# result = (1 == 2) or (2 == 2)    # true
#
# result = (1 == 2) || (3 == 2)    # false
# result = (1 == 2) or (3 == 2)    # false
#
# result = !(1 == 2)               # true
# result = not(1 == 2)             # true

# -----------------------------------------------------
# if文
# -----------------------------------------------------

# number = rand(10)
#
# if number < 3
#   puts number.to_s + 'は3より小さい数'
# elsif number < 6
#   puts number.to_s + 'は3以上で6より小さい数'
# elsif number < 8
#   puts number.to_s + 'は6以上で8より小さい数'
# else
#   puts number.to_s + 'は8か9しか来ません'
# end

# -----------------------------------------------------
# each文
# -----------------------------------------------------

# [1, 2, 3, 4, 5].each do |number|
#   puts number
# end

# (1..5).each do |number|
#   puts number
# end

# fruits = ['apple', 'banana', 'grape', 'orange']
# fruits.each do |fruit|
#   puts fruit
# end

# -----------------------------------------------------
# times文
# -----------------------------------------------------

# 10.times do
#   puts '10回繰り返す'
# end

# 10.times do
#   number = rand(10)
#
#   if number < 5
#     puts number.to_s + 'は5より小さい数'
#   else
#     puts number.to_s + 'は5以上の数'
#   end
# end

# -----------------------------------------------------
# メソッド
# -----------------------------------------------------

# # メソッドを定義
# def sum(a, b)
#   result = 0
#   (a..b).each do |number|
#     result += number
#   end
#   puts result
# end
#
# # メソッドを呼び出し
# sum(1, 9)
# sum(1, 1000)
# sum(1000, 9999)
# sum 1000, 9999    # () を省略しても動作します

# -----------------------------------------------------
# return
# -----------------------------------------------------

# # メソッドを定義
# def sum(a, b)
#   result = 0
#   (a..b).each do |number|
#     result += number
#   end
#   result
# end
#
# # メソッドを呼び出し
# puts sum(1, 9)
# puts sum(1, 1000)
# puts sum(1000, 9999)

# -----------------------------------------------------
# private
# -----------------------------------------------------

# class A
#   def z
#     x
#     y    # 呼び出せる！
#   end
#
#   def x
#     puts 'publicなメソッド'
#   end
#
#   private
#
#   def y
#     puts 'privateなメソッド'
#   end
# end
#
# a = A.new
# a.z
# a.x
# a.y    # これだけエラー

# -----------------------------------------------------
# html & erb
# -----------------------------------------------------

# require 'erb'
#
# def web_page
#   <<-PAGE
#     <!DOCTYPE html>
#     <html lang="ja">
#       <head>
#         <meta charset="UTF-8">
#         <title>タイトル</title>
#       </head>
#       <body>
#         <% name = '太郎' %>
#         <% time_japan = Time.now.getlocal("+09:00") %>
#         <p>今は<%= time_japan.hour %>時です。</p>
#         <% if (6 <= time_japan.hour) && (time_japan.hour < 12) %>
#           <p>おはよう、<%= name %>さん</p>
#         <% elsif (12 <= time_japan.hour) && (time_japan.hour < 18) %>
#           <p>こんにちは、<%= name %>さん</p>
#         <% else %>
#           <p>こんばんは、<%= name %>さん</p>
#         <% end %>
#
#         <ul>
#           <% (1..9).each do |num| %>
#             <li><%= num %></li>
#           <% end %>
#         </ul>
#       </body>
#     </html>
#   PAGE
# end
#
# erb = ERB.new(web_page)
# result = erb.result
#
# puts result
